{
  "mapExplanation": {
    "addMapMarkers": "Modify the setting of mapContext, you can add or delete markers, markers carry labels and callout bubbles.",
    "addCircles": "Modify the setting of mapContext, you can add or delete circles.",
    "addMapPolyGons": "Modify the setting of mapContext, you can add or delete polygans.",
    "addMapPolyLine": "Modify the setting of mapContext, you can add or delete polyline.",
    "addGroundOverlay": "Create a custom image layer and the image will be scaled as the map is scaled.",
    "updateGroundOverlay": "Update custom image layers.",
    "removeGroundOverlay": "Remove the custom image layer.",
    "addMarkers": "Add the marker.",
    "translateMarker": "Translate market, and with animation.",
    "removeMarkers": "Remove the markers.",
    "addArc": "Add arc.",
    "removeArc": "Remove the arc.",
    "addCustomLayer": "Add personalized layers.",
    "removeCustomLayer": "Remove the personalized layers.",
    "addVisualLayer": "Add visualization layers.",
    "removeVisualLayer": "Remove the visualization layers.",
    "getCenterLocation": "Get the latitude and longitude of the current map center.",
    "getRegion": "Acquire the scope of the field of view of the current map.",
    "getRotate": "Get the rotation angle of the current map.",
    "getScale": "Acquire the degree of scaling of the current map.",
    "getSkew": "Get the tilt angle of the current map.",
    "includePoints": "Scale the field of view to display all latitude and longitude degrees.",
    "moveAlong": "Move along a specified path markerFor track playback and other scenarios.",
    "moveToLocation": "Move the center of the map to the current set position.",
    "openMapApp": "Pull up the map app and select navigation.",
    "fromScreenLocation": "Get the latitude and longitude corresponding to the point on the screen. ",
    "setLocMarkerIcon": "Set anchor icon, support network path, local path, code package path",
    "setCenterOffset": "Set Map Center Point Offset, Back Down for Growth",
    "toScreenLocation": "Get the screen coordinates corresponding to latitude and longitude. The origin of the coordinates is the upper left corner of the map.",
    "setBoundary": "Limit the display area of the map. This interface also limits the minimum zoom integer level of the map."
  }
}